package day01;

public class Practice {
    public static void main(String[] args) {
        // 강지흔 학생의 객체를 생성해서 저장한다.
        // 강지흔 학생의 객체의 나이에 26을 저장한다.
        // 강지흔 학생의 객체의 이름에 "강지흔"을 저장한다.

        // 한경훈 학생의 객체를 생성해서 저장한다.
        // 한경훈 학생의 객체의 나이에 25을 저장한다.
        // 한경훈 학생의 객체의 이름에 "한경훈"을 저장한다.

        // 임태우 학생의 객체를 생성해서 저장한다.
        // 임태우 학생의 객체의 나이에 27을 저장한다.
        // 임태우 학생의 객체의 이름에 "임태우"을 저장한다.

        // 이주현 학생의 객체를 생성해서 저장한다.
        // 이주현 학생의 객체의 나이에 23을 저장한다.
        // 이주현 학생의 객체의 이름에 "이주현"을 저장한다.

        // 강지흔 학생의 나이와 한경훈 학생의 나이를 곱해서 저장한다.
        // 임태우 학생의 나이와 이주현 학생의 나이를 더해서 저장한다.
        // 임태우 학생의 나이와 이주현 학생의 나이를 더해서 저장한 값에 강지흔 학생의 나이를 곱해서 저장한다.
        // 임태우 학생의 나이와 이주현 학생의 나이를 더해서 저장한 값에 강지흔 학생의 나이를 곱해서 저장한 값에 한경훈 학생의 나이를 나눈다.

        // 강지흔 학생의 나이와 한경훈 학생의 나이를 곱해서 저장한 값이
        // 임태우 학생의 나이와 이주현 학생의 나이를 더해서 저장한 값에 강지흔 학생의 나이를 곱해서 저장한 값에 한경훈 학생의 나이를 나눈 값보다
        // 큰지 비교한다.

        // 결과를 화면에 출력한다.

    }
}
